; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite5 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite6 - satellite
	instrument11 - instrument
	thermograph0 - mode
	spectrograph1 - mode
	Star6 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	GroundStation4 - direction
	GroundStation7 - direction
	Star5 - direction
	GroundStation8 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	Planet9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument1 thermograph0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star10)
	(supports instrument2 thermograph0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation4)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
	(supports instrument3 spectrograph1)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 GroundStation4)
	(supports instrument5 thermograph0)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument3 satellite3)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation4)
	(supports instrument6 thermograph0)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 GroundStation4)
	(calibration_target instrument6 GroundStation0)
	(calibration_target instrument6 GroundStation3)
	(supports instrument7 spectrograph1)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 GroundStation7)
	(calibration_target instrument7 GroundStation3)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon13)
	(supports instrument8 thermograph0)
	(supports instrument8 spectrograph1)
	(calibration_target instrument8 GroundStation7)
	(calibration_target instrument8 GroundStation8)
	(supports instrument9 spectrograph1)
	(supports instrument9 thermograph0)
	(calibration_target instrument9 GroundStation1)
	(calibration_target instrument9 GroundStation8)
	(calibration_target instrument9 Star5)
	(supports instrument10 thermograph0)
	(supports instrument10 spectrograph1)
	(calibration_target instrument10 GroundStation3)
	(calibration_target instrument10 GroundStation8)
	(on_board instrument8 satellite5)
	(on_board instrument9 satellite5)
	(on_board instrument10 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation1)
	(supports instrument11 thermograph0)
	(supports instrument11 spectrograph1)
	(calibration_target instrument11 GroundStation3)
	(calibration_target instrument11 GroundStation1)
	(on_board instrument11 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star6)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(pointing satellite1 GroundStation1)
	(have_image Planet9 spectrograph1)
	(have_image Star10 thermograph0)
	(have_image Phenomenon11 spectrograph1)
	(have_image Phenomenon12 spectrograph1)
	(have_image Phenomenon13 thermograph0)
))

)

; plan
1. (switch_on instrument9 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument9)
   goals met: 0 of 7
2. (calibrate satellite5 instrument9 groundstation1)
   added: (calibrated instrument9)
   goals met: 0 of 7
3. (turn_to satellite5 phenomenon13 groundstation1)
   deleted: (pointing satellite5 groundstation1)
   added: (pointing satellite5 phenomenon13)
   goals met: 0 of 7
4. (take_image satellite5 phenomenon13 instrument9 thermograph0)
   added: (have_image phenomenon13 thermograph0)
   goals met: 1 of 7
5. (turn_to satellite5 phenomenon12 phenomenon13)
   deleted: (pointing satellite5 phenomenon13)
   added: (pointing satellite5 phenomenon12)
   goals met: 1 of 7
6. (take_image satellite5 phenomenon12 instrument9 spectrograph1)
   added: (have_image phenomenon12 spectrograph1)
   goals met: 2 of 7
7. (turn_to satellite5 phenomenon11 phenomenon12)
   deleted: (pointing satellite5 phenomenon12)
   added: (pointing satellite5 phenomenon11)
   goals met: 2 of 7
8. (turn_to satellite0 groundstation0 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 groundstation0)
   goals met: 3 of 7
9. (take_image satellite5 phenomenon11 instrument9 spectrograph1)
   added: (have_image phenomenon11 spectrograph1)
   goals met: 4 of 7
10. (turn_to satellite1 groundstation1 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 groundstation1)
   goals met: 5 of 7
11. (turn_to satellite5 planet9 phenomenon11)
   deleted: (pointing satellite5 phenomenon11)
   added: (pointing satellite5 planet9)
   goals met: 5 of 7
12. (take_image satellite5 planet9 instrument9 spectrograph1)
   added: (have_image planet9 spectrograph1)
   goals met: 6 of 7
13. (turn_to satellite5 star10 planet9)
   deleted: (pointing satellite5 planet9)
   added: (pointing satellite5 star10)
   goals met: 6 of 7
14. (take_image satellite5 star10 instrument9 thermograph0)
   added: (have_image star10 thermograph0)
   goals met: 7 of 7
